var province_enum = [
    {id: 440000, name: '广东', city: [
        {id: 440100, name: '广州市', district: [
            {id: 440103, name: '荔湾区'},
            {id: 440104, name: '越秀区'},
            {id: 440105, name: '海珠区'},
            {id: 440106, name: '天河区'},
            {id: 440111, name: '白云区'},
            {id: 440112, name: '黄埔区'},
            {id: 440113, name: '番禺区'},
            {id: 440114, name: '花都区'},
            {id: 440315, name: '南沙区'},
            {id: 440317, name: '从化区'},
            {id: 440318, name: '增城区'}
        ]},
    	{id: 440300, name: '深圳市', district: [
            {id: 440303, name: '罗湖区'},
            {id: 440304, name: '福田区'},
            {id: 440305, name: '南山区'},
            {id: 440306, name: '宝安区'},
            {id: 440307, name: '龙岗区'},
            {id: 440308, name: '盐田区'},
            {id: 440309, name: '龙华区'},
            {id: 440310, name: '坪山区'},
            {id: 440312, name: '光明新区'},
            {id: 440314, name: '大鹏新区'}
            
        ]},
        {id: 441300, name: '惠州市', district: [
            {id: 441302, name: '惠城区'},
            {id: 441303, name: '惠阳区'},
            {id: 441322, name: '博罗县'},
            {id: 441323, name: '惠东县'},
            {id: 441324, name: '龙门县'}
        ]},
        {id: 441900, name: '东莞市', district: [
            {id: 441902, name: '中堂镇'},
            {id: 441903, name: '南城区'},
            {id: 441904, name: '长安镇'},
            {id: 441905, name: '东坑镇'},
            {id: 441906, name: '樟木头镇'},
            {id: 441907, name: '莞城区'},
            {id: 441908, name: '石龙镇'},
            {id: 441909, name: '桥头镇'},
            {id: 441910, name: '万江区'},
            {id: 441911, name: '麻涌镇'},
            {id: 441912, name: '虎门镇'},
            {id: 441913, name: '谢岗镇'},
            {id: 441914, name: '石碣镇'},
            {id: 441915, name: '茶山镇'},
            {id: 441916, name: '东城区'},
            {id: 441917, name: '洪梅镇'},
            {id: 441918, name: '道滘镇'},
            {id: 441919, name: '高埗镇'},
            {id: 441920, name: '企石镇'},
            {id: 441921, name: '凤岗镇'},
            {id: 441922, name: '大岭山镇'},
            {id: 441923, name: '松山湖'},
            {id: 441924, name: '清溪镇'},
            {id: 441925, name: '望牛墩镇'},
            {id: 441926, name: '厚街镇'},
            {id: 441927, name: '常平镇'},
            {id: 441928, name: '寮步镇'},
            {id: 441929, name: '石排镇'},
            {id: 441930, name: '横沥镇'},
            {id: 441931, name: '塘厦镇'},
            {id: 441932, name: '黄江镇'},
            {id: 441933, name: '大朗镇'},
            {id: 441990, name: '沙田镇'}
        ]}
    ]}
]